cf_billing/InformationRegisters/энргВладельцыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВладельцыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АбонентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
						<v8:Type>cfg:CatalogRef.бестСтруктураСети</v8:Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестУслугиТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестУслугиТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестСостояниеПриборовУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСостояниеПриборовУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестРасчетныеСпособыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРасчетныеСпособыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетныйСпособ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПриборовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ввод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вывод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПоверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonForms/бестФормаВыбораТочкиУчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период  					= Параметры.СтруктураОтбора.Период;
	Транзит 					= Ложь;
	Если Параметры.СтруктураОтбора.Свойство("Район") Тогда
		Район 						= Параметры.СтруктураОтбора.Район;
	Иначе
		Транзит = Истина;
	КонецЕсли;
	Организация 				= Параметры.СтруктураОтбора.Организация;
	ОбъектРасчета				= ?(Параметры.СтруктураОтбора.Свойство("ОбъектРасчета"), Параметры.СтруктураОтбора.ОбъектРасчета, Неопределено);
	
	ТочкиСПриборами				= ?(Параметры.Свойство("ТочкиСПриборами"), Параметры.ТочкиСПриборами, Истина);
	ВыводитьСоставные			= ?(Параметры.Свойство("ВыводитьСоставные"), Параметры.ВыводитьСоставные, Ложь);
	Услуга						= ?(Параметры.СтруктураОтбора.Свойство("Услуга"), Параметры.СтруктураОтбора.Услуга, Неопределено);
	ТолькоУслуги				= ?(Параметры.Свойство("ТолькоУслуги"), Параметры.ТолькоУслуги, Ложь);
	РасчетныйСпособ				= ?(Параметры.Свойство("РасчетныйСпособ"), Параметры.РасчетныйСпособ, Неопределено);

	Элементы.ДанныеСоставныхУслугПоставщик.Видимость = Не ТолькоУслуги;
	
	Схема						= Неопределено;
	ПараметрыОтбор				= Новый Массив;
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраВСписке", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
	
	ПараметрыВыбора	 				= Новый Структура("ПараметрыВТ,Отбор", ПараметрыВТ,ПараметрыОтбор);
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыВыбора.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	КонецЕсли;
	
	РегистрыСведений.энргВладельцыТочекУчета.ТочкиУчетаПомещения(Схема, ПараметрыВыбора);
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",			Период);
	Если Не Транзит Тогда
		ПараметрыЗапроса.Вставить("Район",			Район);
	КонецЕсли;
	ПараметрыЗапроса.Вставить("Организация",	Организация);  
	ПараметрыЗапроса.Вставить("КлючПомещения",	ОбъектРасчета);
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);;
	
	Выборка  					= РезультатЗапроса.Выгрузить();
	СписокТУ  					= Выборка.ВыгрузитьКолонку("ТочкаУчета");
	 
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	бестУслугиТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестУслугиТочекУчетаНПСрезПоследних.Услуга КАК Услуга
	|ПОМЕСТИТЬ ТочкиСУслугами
	|ИЗ
	|	РегистрСведений.бестУслугиТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В (&СписокТУ)) КАК бестУслугиТочекУчетаНПСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТочкиСУслугами.ТочкаУчета КАК ТочкаУчета,
	|	ТочкиСУслугами.Услуга КАК Услуга
	|ПОМЕСТИТЬ ПростыеУслуги
	|ИЗ
	|	ТочкиСУслугами КАК ТочкиСУслугами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО ТочкиСУслугами.Услуга = энргВидыУслуг.Ссылка
	|			И (НЕ энргВидыУслуг.СоставнаяУслуга
	|				ИЛИ &ВыводитьСоставные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТочкиСУслугами.ТочкаУчета,
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|ИЗ
	|	ТочкиСУслугами КАК ТочкиСУслугами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ПО ТочкиСУслугами.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
	|			И (энргВидыУслугСоставляющиеУслуг.Ссылка.СоставнаяУслуга)
	|ГДЕ
	|	НЕ &ВыводитьСоставные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ ВведенныеПУ
	|ИЗ
	|	РегистрСведений.бестСостояниеПриборовУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В (&СписокТУ)) КАК бестСостояниеПриборовУчетаНПСрезПоследних
	|ГДЕ
	|	бестСостояниеПриборовУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеПриборовУчета.Ввод)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестРасчетныеСпособыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета
	|ПОМЕСТИТЬ РасчетныеСпособыТУ
	|ИЗ
	|	РегистрСведений.бестРасчетныеСпособыТочекУчетаНП.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ТочкаУчета В (&СписокТУ)) КАК бестРасчетныеСпособыТочекУчетаНПСрезПоследних
	|ГДЕ
	|	бестРасчетныеСпособыТочекУчетаНПСрезПоследних.РасчетныйСпособ = &РасчетныйСпособ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПростыеУслуги.ТочкаУчета КАК ТочкаУчета,
	|	ПростыеУслуги.Услуга КАК Услуга
	|ИЗ
	|	ПростыеУслуги КАК ПростыеУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВведенныеПУ КАК ВведенныеПУ
	|		ПО ПростыеУслуги.ТочкаУчета = ВведенныеПУ.ТочкаУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетныеСпособыТУ КАК РасчетныеСпособыТУ
	|		ПО ПростыеУслуги.ТочкаУчета = РасчетныеСпособыТУ.ТочкаУчета
	|ГДЕ
	|	ПростыеУслуги.Услуга = &Услуга
	|	И ВЫБОР
	|			КОГДА &ТочкиСПриборами
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВведенныеПУ.ТочкаУчета ЕСТЬ NULL
	|		КОНЕЦ
	|	И НЕ РасчетныеСпособыТУ.ТочкаУчета ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПростыеУслуги.Услуга,
	|	ПростыеУслуги.ТочкаУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаУчета,
	|	Услуга";
	
	
	Запрос.Текст = Текст;
	Если Услуга = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПростыеУслуги.Услуга = &Услуга", "Истина");
	Иначе
		Запрос.УстановитьПараметр("Услуга", Услуга);
	КонецЕсли;

	Запрос.УстановитьПараметр("СписокТУ", СписокТУ);
	Запрос.УстановитьПараметр("ВыводитьСоставные", ВыводитьСоставные);
	Запрос.УстановитьПараметр("ТочкиСПриборами", ТочкиСПриборами);
	Запрос.УстановитьПараметр("РасчетныйСпособ", РасчетныйСпособ);
	Если Не ЗначениеЗаполнено(РасчетныйСпособ) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ РасчетныеСпособыТУ.ТочкаУчета ЕСТЬ NULL", "Истина");
	КонецЕсли;
	
	Для Каждого ТекПараметр Из Параметры.СтруктураОтбора Цикл
		Запрос.Параметры.Вставить(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	Если Транзит Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Район = &Район", "Истина");
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если ТолькоУслуги Тогда
		Результат.Свернуть("Услуга");	
	КонецЕсли;
	
	ДанныеТочекУчета.Загрузить(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ЗакрытьФорму(Элементы.ДанныеТочекУчета.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЗакрытьФорму(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ДанныеТочекУчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму(Элементы.ДанныеТочекУчета.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ТекДанные)
	Если ТекДанные <> Неопределено Тогда
		Закрыть(Новый Структура("ТочкаУчета, Услуга", ТекДанные.ТочкаУчета, ТекДанные.Услуга));
	Иначе
		Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
